dave1b/Micro-C/SW06Interrupt/board/pin_mux.c
    /* PORTB20 (pin F10) is configured as PTB20 */
    PORT_SetPinMux(LED_RED_R_L_BREAK_PORT, LED_RED_R_L_BREAK_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin C6) is configured as PTC10 */
    PORT_SetPinMux(LED_BLUE_F_L_PORT, LED_BLUE_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin C5) is configured as PTC11 */
    PORT_SetPinMux(LED_GREEN_F_R_PORT, LED_GREEN_F_R_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin A7) is configured as PTC8 */
    PORT_SetPinMux(LED_GREEN_F_L_PORT, LED_GREEN_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin D6) is configured as PTC9 */
    PORT_SetPinMux(LED_RED_F_L_PORT, LED_RED_F_L_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin C3) is configured as PTD2 */
    PORT_SetPinMux(LED_RED_F_R_PORT, LED_RED_F_R_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin B3) is configured as PTD3 */
    PORT_SetPinMux(LED_BLUE_F_R_PORT, LED_BLUE_F_R_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
JOYSTICK:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G11, peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, pull_select: up, pull_enable: enable}
  - {pin_num: G10, peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM1_QD_PHB, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, pull_select: up, pull_enable: enable}
  - {pin_num: G9, peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, pull_select: up, pull_enable: enable}
  - {pin_num: E10, peripheral: GPIOB, signal: 'GPIO, 9', pin_signal: PTB9/SPI1_PCS1/LPUART0_CTS_b/FB_AD20, identifier: LEFT, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, pull_select: up, pull_enable: enable}
  - {pin_num: G8, peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : JOYSTICK
 * Description   : All joystick input pins
 *
 * END ****************************************************************************************************************/
void JOYSTICK(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t RIGHT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin G11)  */
    GPIO_PinInit(JOYSTICK_RIGHT_GPIO, JOYSTICK_RIGHT_PIN, &RIGHT_config);

    gpio_pin_config_t DOWN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin G10)  */
    GPIO_PinInit(JOYSTICK_DOWN_GPIO, JOYSTICK_DOWN_PIN, &DOWN_config);

    gpio_pin_config_t UP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin G9)  */
    GPIO_PinInit(JOYSTICK_UP_GPIO, JOYSTICK_UP_PIN, &UP_config);

    gpio_pin_config_t PUSH_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin G8)  */
    GPIO_PinInit(JOYSTICK_PUSH_GPIO, JOYSTICK_PUSH_PIN, &PUSH_config);

    gpio_pin_config_t LEFT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin E10)  */
    GPIO_PinInit(JOYSTICK_LEFT_GPIO, JOYSTICK_LEFT_PIN, &LEFT_config);

    /* PORTB0 (pin G11) is configured as PTB0 */
    PORT_SetPinMux(JOYSTICK_RIGHT_PORT, JOYSTICK_RIGHT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB0 (pin G11): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(JOYSTICK_RIGHT_PORT, JOYSTICK_RIGHT_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTB1 (pin G10) is configured as PTB1 */
    PORT_SetPinMux(JOYSTICK_DOWN_PORT, JOYSTICK_DOWN_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB1 (pin G10): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(JOYSTICK_DOWN_PORT, JOYSTICK_DOWN_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[1] = ((PORTB->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTB2 (pin G9) is configured as PTB2 */
    PORT_SetPinMux(JOYSTICK_UP_PORT, JOYSTICK_UP_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB2 (pin G9): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(JOYSTICK_UP_PORT, JOYSTICK_UP_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

