dave1b/Micro-C/SW06Interrupt/board/pin_mux.c
                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTB3 (pin G8) is configured as PTB3 */
    PORT_SetPinMux(JOYSTICK_PUSH_PORT, JOYSTICK_PUSH_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB3 (pin G8): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(JOYSTICK_PUSH_PORT, JOYSTICK_PUSH_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTB9 (pin E10) is configured as PTB9 */
    PORT_SetPinMux(JOYSTICK_LEFT_PORT, JOYSTICK_LEFT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB9 (pin E10): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(JOYSTICK_LEFT_PORT, JOYSTICK_LEFT_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
